# . Consider two excel files having attendance of a workshop’s participants for two days. Each file has three
# fields ‘Name’, ‘Time of joining’, duration (in minutes) where names are unique within a file. Note that duration
# may take one of three values (30, 40, 50) only. Import the data into two dataframes and do the following:

# a.) Perform merging of the two dataframes to find the names of students who had attended the workshop on both days.

In [4]:
import pandas as pd

day1 = pd.read_excel('day1.xlsx')
day2 = pd.read_excel('day2.xlsx')

In [5]:
day1

    Name Time of joining  Duration (in minutes)
0  Alice        09:15:00                     50
1    Bob        09:30:00                     40
2  Carol        09:45:00                     30
3   Dave        10:00:00                     50
4    Eve        10:15:00                     40

In [6]:
day2

    Name Time of joining  Duration (in minutes)
0  Alice        09:00:00                     40
1    Bob        09:15:00                     50
2  Carol        09:30:00                     30
3  David        09:45:00                     40
4  Frank        10:00:00                     50

In [7]:
n_df = day1.merge(day2,on='Name',how='inner')
print(n_df['Name'])

0    Alice
1      Bob
2    Carol
Name: Name, dtype: object

# b.) Find names of all students who have attended workshop on either of the days

In [8]:
student_attended = day1.merge(day2,how='outer',on='Name')
student_attended['Name']

0    Alice
1      Bob
2    Carol
3     Dave
4      Eve
5    David
6    Frank
Name: Name, dtype: object

# c.) Merge two data frames row-wise and find the total number of records in the data frame.

In [18]:
data=pd.merge(day1,day2,on='Name',how='outer')
data

,Name,Time of joining_x,Duration (in minutes)_x,Time of joining_y,Duration (in minutes)_y
0,Alice,09:15:00,50.0,09:00:00,40.0
1,Bob,09:30:00,40.0,09:15:00,50.0
2,Carol,09:45:00,30.0,09:30:00,30.0
3,Dave,10:00:00,50.0,NaN,NaN
4,Eve,10:15:00,40.0,NaN,NaN
5,David,NaN,NaN,09:45:00,40.0
6,Frank,NaN,NaN,10:00:00,50.0

In [19]:
print('total records :',data.shape[0])

total records : 7

# d.) Merge two dataframes and use two columns names and duration as multi-row indexes. Generate descriptive statistics for this multi-index

In [10]:
a=day1.merge(day2,how='outer')
a

    Name Time of joining  Duration (in minutes)
0  Alice        09:15:00                     50
1    Bob        09:30:00                     40
2  Carol        09:45:00                     30
3   Dave        10:00:00                     50
4    Eve        10:15:00                     40
5  Alice        09:00:00                     40
6    Bob        09:15:00                     50
7  Carol        09:30:00                     30
8  David        09:45:00                     40
9  Frank        10:00:00                     50

In [11]:
a=a.set_index(['Name','Duration (in minutes)'])
a

                            Time of joining
Name  Duration (in minutes)
Alice 50                           09:15:00
Bob   40                           09:30:00
Carol 30                           09:45:00
Dave  50                           10:00:00
Eve   40                           10:15:00
Alice 40                           09:00:00
Bob   50                           09:15:00
Carol 30                           09:30:00
David 40                           09:45:00
Frank 50                           10:00:00

In [20]:
a.describe()

       Time of joining
count               10
unique               6
top           09:15:00
freq                 2